Org-Mode_Exemple_Complet_Minimal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-25 Sat 22:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Grant Rettke" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org56dc263">1. Org-Mode Exemple Complet Minimal</a>
<ul>
<li><a href="#orgea42d6d">1.1. Principle of Least Astonishment (POLA)</a>
<ul>
<li><a href="#org697e351">1.1.1. Time</a></li>
<li><a href="#org2b164ad">1.1.2. Garbage Collection</a></li>
<li><a href="#orgfb1fead">1.1.3. Load Behavior</a></li>
</ul>
</li>
<li><a href="#org4c379c8">1.2. Org-Mode Exemple Complet Minimal</a>
<ul>
<li><a href="#org2f71afb">1.2.1. Things That Must Occur Before Loading Org-Mode</a></li>
<li><a href="#org7d3e8d2">1.2.2. Loading Org-Mode</a></li>
<li><a href="#orgabb83a2">1.2.3. Things That Must Occur Only After Loading Org-Mode</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Never compile this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga6cd7fe"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- no-byte-compile: t; -*-</span>
</pre>
</div>

<div id="outline-container-org56dc263" class="outline-2">
<h2 id="org56dc263"><span class="section-number-2">1</span> Org-Mode Exemple Complet Minimal</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:1035FF79-3703-49A6-8522-618B38A48F6C
</pre>

<p>
Configure EMACS to easily provide ECMs.
</p>

<p>
Sysop is likely to use this often.
</p>

<p>
Start EMACS with this command:
</p>

<pre class="example">
emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black  --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name ECM-TEST --title ECM-TEST --load ~/src/help/.org-mode-ecm.emacs.el &amp;
</pre>
</div>

<div id="outline-container-orgea42d6d" class="outline-3">
<h3 id="orgea42d6d"><span class="section-number-3">1.1</span> Principle of Least Astonishment (POLA)</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:626B5DD1-97D8-4B85-96BC-B9A96F18AF1E
</pre>
</div>
<div id="outline-container-org697e351" class="outline-4">
<h4 id="org697e351"><span class="section-number-4">1.1.1</span> Time</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
ID: org_gcr_2018-03-16_mara:BC16A47E-FC4E-4F12-8813-583BF4C3EF5A
</pre>
<p>
Standardize timestamps.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7d16fc2">(<span class="org-keyword">defun</span> <span class="org-function-name">help/get-timestamp</span> ()
  <span class="org-doc">"Produces a full ISO 8601 format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((timestamp-without-timezone (format-time-string <span class="org-string">"%Y-%m-%dT%T"</span>))
         (timezone-name-in-numeric-form (format-time-string <span class="org-string">"%z"</span>))
         (timezone-utf-offset
          (concat (substring timezone-name-in-numeric-form 0 3)
                  <span class="org-string">":"</span>
                  (substring timezone-name-in-numeric-form 3 5)))
         (timestamp (concat timestamp-without-timezone
                            timezone-utf-offset)))
    timestamp))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-timestamp</span> ()
  <span class="org-doc">"Inserts a full ISO 8601 format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (help/get-timestamp)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/get-timestamp-no-colons</span> ()
  <span class="org-doc">"Produces a full ISO 8601 format timestamp with colons replaced by hyphens."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((timestamp (help/get-timestamp))
         (timestamp-no-colons (replace-regexp-in-string <span class="org-string">":"</span> <span class="org-string">"-"</span> timestamp)))
    timestamp-no-colons))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-timestamp-no-colons</span> ()
  <span class="org-doc">"Inserts a full ISO 8601 format timestamp with colons replaced by hyphens."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (help/get-timestamp-no-colons)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/insert-datestamp</span> ()
  <span class="org-doc">"Produces and inserts a partial ISO 8601 format timestamp."</span>
  (<span class="org-keyword">interactive</span>)
  (insert (format-time-string <span class="org-string">"%F"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2b164ad" class="outline-4">
<h4 id="org2b164ad"><span class="section-number-4">1.1.2</span> Garbage Collection</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
ID: org_gcr_2017-07-29_mara:5A6162AE-F0FD-491D-BC05-F288F46F6125
</pre>
<p>
Clear memory and disable garbage collection or return garbage collection to
normal.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3af8372">(<span class="org-keyword">setq</span> help/default-gc-cons-threshold gc-cons-threshold)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-gc-cons-threshold</span> (<span class="org-type">&amp;optional</span> multiplier notify)
  <span class="org-doc">"Set `</span><span class="org-doc"><span class="org-constant">gc-cons-threshold</span></span><span class="org-doc">' either to its default value or a</span>
<span class="org-doc">   `</span><span class="org-doc"><span class="org-constant">multiplier</span></span><span class="org-doc">' thereof."</span>
  (<span class="org-keyword">let*</span> ((new-multiplier (<span class="org-keyword">or</span> multiplier 1))
         (new-threshold (* help/default-gc-cons-threshold
                           new-multiplier)))
    (<span class="org-keyword">setq</span> gc-cons-threshold new-threshold)
    (<span class="org-keyword">when</span> notify (message <span class="org-string">"Setting `</span><span class="org-string"><span class="org-constant">gc-cons-threshold</span></span><span class="org-string">' to %s"</span> new-threshold))))
</pre>
</div>
</div>
</div>
