Org-Mode_Exemple_Complet_Minimal.md
- [Org-Mode Exemple Complet Minimal](#orgfb61781)
  - [Principle of Least Astonishment (POLA)](#org18b63e2)
    - [Time](#org5a79fc4)
    - [Garbage Collection](#orgd471c6b)
    - [Load Behavior](#org30e7ad3)
  - [Org-Mode Exemple Complet Minimal](#org7ad33f4)
    - [Things That Must Occur Before Loading Org-Mode](#org13dbcbf)
    - [Loading Org-Mode](#org0cb0c14)
    - [Things That Must Occur Only After Loading Org-Mode](#org7972f56)

Never compile this.

```emacs-lisp
;; -*- no-byte-compile: t; -*-
```


<a id="orgfb61781"></a>

# Org-Mode Exemple Complet Minimal

    ID: org_gcr_2017-05-12_mara:1035FF79-3703-49A6-8522-618B38A48F6C

Configure EMACS to easily provide ECMs.

Sysop is likely to use this often.

Start EMACS with this command:

    emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black  --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name ECM-TEST --title ECM-TEST --load ~/src/help/.org-mode-ecm.emacs.el &


<a id="org18b63e2"></a>

## Principle of Least Astonishment (POLA)

    ID: org_gcr_2017-05-12_mara:626B5DD1-97D8-4B85-96BC-B9A96F18AF1E


<a id="org5a79fc4"></a>

### Time

    ID: org_gcr_2018-03-16_mara:BC16A47E-FC4E-4F12-8813-583BF4C3EF5A

Standardize timestamps.

```emacs-lisp
(defun help/get-timestamp ()
  "Produces a full ISO 8601 format timestamp."
  (interactive)
  (let* ((timestamp-without-timezone (format-time-string "%Y-%m-%dT%T"))
         (timezone-name-in-numeric-form (format-time-string "%z"))
         (timezone-utf-offset
          (concat (substring timezone-name-in-numeric-form 0 3)
                  ":"
                  (substring timezone-name-in-numeric-form 3 5)))
         (timestamp (concat timestamp-without-timezone
                            timezone-utf-offset)))
    timestamp))

(defun help/insert-timestamp ()
  "Inserts a full ISO 8601 format timestamp."
  (interactive)
  (insert (help/get-timestamp)))

(defun help/get-timestamp-no-colons ()
  "Produces a full ISO 8601 format timestamp with colons replaced by hyphens."
  (interactive)
  (let* ((timestamp (help/get-timestamp))
         (timestamp-no-colons (replace-regexp-in-string ":" "-" timestamp)))
    timestamp-no-colons))

(defun help/insert-timestamp-no-colons ()
  "Inserts a full ISO 8601 format timestamp with colons replaced by hyphens."
  (interactive)
  (insert (help/get-timestamp-no-colons)))

(defun help/insert-datestamp ()
  "Produces and inserts a partial ISO 8601 format timestamp."
  (interactive)
  (insert (format-time-string "%F")))
```


<a id="orgd471c6b"></a>

### Garbage Collection

    ID: org_gcr_2017-07-29_mara:5A6162AE-F0FD-491D-BC05-F288F46F6125

Clear memory and disable garbage collection or return garbage collection to normal.

```emacs-lisp
(setq help/default-gc-cons-threshold gc-cons-threshold)
(defun help/set-gc-cons-threshold (&optional multiplier notify)
  "Set `gc-cons-threshold' either to its default value or a
   `multiplier' thereof."
  (let* ((new-multiplier (or multiplier 1))
         (new-threshold (* help/default-gc-cons-threshold
                           new-multiplier)))
    (setq gc-cons-threshold new-threshold)
    (when notify (message "Setting `gc-cons-threshold' to %s" new-threshold))))
```
