Org-Mode_Exemple_Complet_Minimal.html
<div id="outline-container-orgfb1fead" class="outline-4">
<h4 id="orgfb1fead"><span class="section-number-4">1.1.3</span> Load Behavior</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
ID: org_gcr_2017-05-12_mara:75985F03-F3B9-4DA3-8F6E-393E4C2F06E7
</pre>

<p>
EMACS can load 3 different representations of a Emacs-Lisp source file code
OOTB. The name of source code file is the value before the file extension. When
you pass <code>load</code> a name it searches for an acceptable representation. Representation
types are indicated by their extension name. <code>.el</code> is a human readable and
uncompiled. <code>.elc</code> is not human readable and compiled. <code>.gz</code> is Gzip compressed and
contains <code>.el</code> or <code>.elc</code> files.
</p>

<p>
The variable <code>load-suffixes</code> determines the order for which text and byte-code
representations are first searched by extension-name. The variable
<code>load-file-rep-suffixes</code> determines the order for all other extension types.
</p>

<p>
OOTB, EMACS combines the productivity of REPL style of development with the
speed of compiled code by <code>load</code>'ing byte-code first, text second, and compressed
third. This workflow gives you the fastest code at run-time and lets you
experiment with new features stored in text. When you are ready to use them
every time, you compile them. There is only one downside of this approach: when
you forget that it works this way it can be confusing.
</p>

<p>
When you forget about that style of system you end up with surprising behavior.
The surprise comes when you forget to compile code and then write new code that
depends on the now old version of that code. After the next build, your system
can break in surprising ways. This violates the Principle of Least Astonishment.
</p>

<p>
This system values predictability so it does the simplest thing possible: <code>load</code>
searches for the newest representation of a file and uses that one. It assumes
that Sysop has total and complete control over the management of file
representations.
</p>

<p>
This is the <b>first</b> thing that <i>ought</i> to happen in the initialization of <b>any</b>
tangled system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc4e3e14">(<span class="org-keyword">setq</span> load-prefer-newer t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c379c8" class="outline-3">
<h3 id="org4c379c8"><span class="section-number-3">1.2</span> Org-Mode Exemple Complet Minimal</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
ID: org_gcr_2017-05-12_mara:572E2309-5DCA-4AE1-AAC4-36B7E07AD46D
</pre>

<p>
Every new EMACS releases comes with the latest stable Org-Mode release. To get
hot-fixes, cutting edge features, and easy patch creation though, you need to
use the version from Git.
</p>

<p>
These detailed and clear <a href="http://orgmode.org/manual/Installation.html">directions</a> explain how ot run Org-Mode from Git. The only
thing worth mentioning again is that in order to use <b>any</b> version of Org-Mode
other than the one that comes OOTB you <b>must</b> load Org-Mode <b>before</b> anything else
in your initialization file. It is easy to do! When you get
unexpected Org-Mode behavior be sure to stop and investigate <code>org-version</code> and
decide whether or not it is what you expect and prepare an ECM if necessary.
</p>
</div>

<div id="outline-container-org2f71afb" class="outline-4">
<h4 id="org2f71afb"><span class="section-number-4">1.2.1</span> Things That Must Occur Before Loading Org-Mode</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
ID: org_gcr_2017-07-30_mara:3CF35008-D435-4CCB-90D7-5CFA06E15467
</pre>
<p>
Add the Org-Mode core distribution the load path.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org08a93e3">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/org-mode/lisp"</span>)
</pre>
</div>

<p>
Add the Org-Mode-Contributions distribution to the load path. The contributions
are essential.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6be953a">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/org-mode/contrib/lisp"</span>)
</pre>
</div>

<p>
Allow single-character alphabetical bullet lists. This configuration must occur
before loading Org-Mode. <b>Never</b> remove this from a submitted ECM.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org487cbe7">(<span class="org-keyword">setq</span> org-list-allow-alphabetical t)
</pre>
</div>

<p>
Unchecked boxes prevent marking the parent as done. This configuration must
occur before loading Org-Mode. <b>Never</b> remove this from a submitted ECM.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc650eeb">(<span class="org-keyword">setq</span> org-enforce-todo-checkbox-dependencies t)
</pre>
</div>

<p>
Use math double brackets for <span class="underline">Literate Programming</span> instead of GUILLEMET delimeters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org34ecdbd">(<span class="org-keyword">setq</span> org-babel-noweb-wrap-start <span class="org-string">"&#10218;"</span>)
(<span class="org-keyword">setq</span> org-babel-noweb-wrap-end <span class="org-string">"&#10219;"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d3e8d2" class="outline-4">
<h4 id="org7d3e8d2"><span class="section-number-4">1.2.2</span> Loading Org-Mode</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
ID: org_gcr_2017-07-30_mara:FFA7E062-C039-4F3F-82FC-12A49FF379B8
</pre>
<p>
Load Org-Mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6d516fc">(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">org</span>)
</pre>
</div>
</div>
</div>
