Org-Mode_Exemple_Complet_Minimal.md


<a id="org30e7ad3"></a>

### Load Behavior

    ID: org_gcr_2017-05-12_mara:75985F03-F3B9-4DA3-8F6E-393E4C2F06E7

EMACS can load 3 different representations of a Emacs-Lisp source file code OOTB. The name of source code file is the value before the file extension. When you pass `load` a name it searches for an acceptable representation. Representation types are indicated by their extension name. `.el` is a human readable and uncompiled. `.elc` is not human readable and compiled. `.gz` is Gzip compressed and contains `.el` or `.elc` files.

The variable `load-suffixes` determines the order for which text and byte-code representations are first searched by extension-name. The variable `load-file-rep-suffixes` determines the order for all other extension types.

OOTB, EMACS combines the productivity of REPL style of development with the speed of compiled code by `load`'ing byte-code first, text second, and compressed third. This workflow gives you the fastest code at run-time and lets you experiment with new features stored in text. When you are ready to use them every time, you compile them. There is only one downside of this approach: when you forget that it works this way it can be confusing.

When you forget about that style of system you end up with surprising behavior. The surprise comes when you forget to compile code and then write new code that depends on the now old version of that code. After the next build, your system can break in surprising ways. This violates the Principle of Least Astonishment.

This system values predictability so it does the simplest thing possible: `load` searches for the newest representation of a file and uses that one. It assumes that Sysop has total and complete control over the management of file representations.

This is the **first** thing that *ought* to happen in the initialization of **any** tangled system.

```emacs-lisp
(setq load-prefer-newer t)
```


<a id="org7ad33f4"></a>

## Org-Mode Exemple Complet Minimal

    ID: org_gcr_2017-05-12_mara:572E2309-5DCA-4AE1-AAC4-36B7E07AD46D

Every new EMACS releases comes with the latest stable Org-Mode release. To get hot-fixes, cutting edge features, and easy patch creation though, you need to use the version from Git.

These detailed and clear [directions](http://orgmode.org/manual/Installation.html) explain how ot run Org-Mode from Git. The only thing worth mentioning again is that in order to use **any** version of Org-Mode other than the one that comes OOTB you **must** load Org-Mode **before** anything else in your initialization file. It is easy to do! When you get unexpected Org-Mode behavior be sure to stop and investigate `org-version` and decide whether or not it is what you expect and prepare an ECM if necessary.


<a id="org13dbcbf"></a>

### Things That Must Occur Before Loading Org-Mode

    ID: org_gcr_2017-07-30_mara:3CF35008-D435-4CCB-90D7-5CFA06E15467

Add the Org-Mode core distribution the load path.

```emacs-lisp
(add-to-list 'load-path "~/src/org-mode/lisp")
```

Add the Org-Mode-Contributions distribution to the load path. The contributions are essential.

```emacs-lisp
(add-to-list 'load-path "~/src/org-mode/contrib/lisp")
```

Allow single-character alphabetical bullet lists. This configuration must occur before loading Org-Mode. **Never** remove this from a submitted ECM.

```emacs-lisp
(setq org-list-allow-alphabetical t)
```

Unchecked boxes prevent marking the parent as done. This configuration must occur before loading Org-Mode. **Never** remove this from a submitted ECM.

```emacs-lisp
(setq org-enforce-todo-checkbox-dependencies t)
```

Use math double brackets for <span class="underline">Literate Programming</span> instead of GUILLEMET delimeters.

```emacs-lisp
(setq org-babel-noweb-wrap-start "⟪")
(setq org-babel-noweb-wrap-end "⟫")
```


<a id="org0cb0c14"></a>

### Loading Org-Mode

    ID: org_gcr_2017-07-30_mara:FFA7E062-C039-4F3F-82FC-12A49FF379B8

Load Org-Mode.

```emacs-lisp
(require 'org)
```
