Org-Mode_Exemple_Complet_Minimal.html
<div id="outline-container-orgabb83a2" class="outline-4">
<h4 id="orgabb83a2"><span class="section-number-4">1.2.3</span> Things That Must Occur Only After Loading Org-Mode</h4>
<div class="outline-text-4" id="text-1-2-3">
<pre class="example">
ID: org_gcr_2017-07-30_mara:D9207828-3783-4599-BA48-A6EB2C3FCAE4
</pre>

<p>
Helper doubles available memory.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdab7213">(<span class="org-keyword">defun</span> <span class="org-function-name">help/double-gc-cons-threshold</span> () <span class="org-doc">"Double `</span><span class="org-doc"><span class="org-constant">gc-cons-threshold</span></span><span class="org-doc">'."</span> (help/set-gc-cons-threshold 2))
</pre>
</div>

<p>
Double garbage collection during tangling. Instead of storing this in the
primary Org-Mode Literate Programming configuration I want it here so that it
is always available.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb50282d">(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-pre-tangle-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/double-gc-cons-threshold</span>)
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-babel-post-tangle-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">help/set-gc-cons-threshold</span>)
</pre>
</div>

<p>
Display system info.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org61aeaf1">(<span class="org-keyword">defun</span> <span class="org-function-name">help/display-system-info</span> ()
  (<span class="org-keyword">interactive</span>)
  (message <span class="org-string">"&lt;&lt;&lt;ECM Information&gt;&gt;&gt;\nThis buffer file: %s\nAs Of: %s\nOrg-Version: %s\nOrg-Git-Version:%s\nEmacs-Version: %s\nNoweb wrap start and stop delimeters: '%s' and '%s'\norg-babel-default-header-args:\n"</span>
           buffer-file-name
           (help/get-timestamp)
           (org-version)
           (org-git-version)
           (emacs-version)
           org-babel-noweb-wrap-start
           org-babel-noweb-wrap-end)
  (pp org-babel-default-header-args))
(help/display-system-info)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grant Rettke</p>
<p class="date">Created: 2018-08-25 Sat 22:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
